import React,{Component} from 'react';
import { routerRedux} from 'dva/router';
import {connect} from 'dva';
import Title from '../components/Title';
import styles from "./style/Gvrp.less";
import left from '../assets/icon-img/return.png';
@connect(state => ({
    user: state.user
  }))
export default class Agentment extends Component {
  // 返回
  returnGoBack=()=>{
    const {dispatch}=this.props;
    dispatch(
      routerRedux.goBack()
    )
  }
  render(){
    // 顶部title参数
    const Titles = {
      tit: "代理商协议",
      lbgimg:'url(' + left + ')',
   }
    return (
      <div className={styles.App}>
        { /* 顶部title */ }
        <Title { ...Titles} leftFunc={ this.returnGoBack }/>
        <div className={styles.main} style={{'padding':'.1rem .25rem .5rem'}}>
            <h2 style={{fontSize:'.5rem',fontWeight:'bold',margin:'.2rem auto .3rem',textAlign:'center'}}>代理商（品牌股东）合作协议</h2>
            <div style={{lineHeight:'.6rem'}}>
                <strong style={{fontSize:'.35rem'}}>甲方：</strong>
                <span style={{textDecoration:'underline',fontSize:'.3rem'}}>西安市钱库商贸有限公司《丝霖蔓雨品牌》</span>
            </div>
            <p style={{fontSize:'.3rem',textIndent:0}}><span style={{display:'inline'}}>联系地址：</span><span style={{textDecoration:'underline',display:'inline'}}>西安市未央区太元路华远君城国际A座2402室</span></p>
            <p style={{fontSize:'.3rem',textIndent:0}}><span style={{display:'inline'}}>营业执照注册号：</span><span style={{textDecoration:'underline',display:'inline'}}>91610133311068715R</span></p>
            <p style={{fontSize:'.3rem',textIndent:0}}><span style={{display:'inline'}}>电话：</span><span style={{textDecoration:'underline',display:'inline'}}>4000770019/02981040820</span></p>
            <div style={{lineHeight:'.6rem'}}>
                <strong style={{fontSize:'.35rem'}}>乙方：</strong>
                <span style={{fontSize:'.3rem'}}>姓名、电话、地址，身份证</span>
            </div>
            <p>以注册APP上传的资料为真实有效，一经核实上传资料信息有误者将取消代理商的一切合法权益。</p>
            <p>根据《中华人民共和国合同法》及有关规定，甲乙双方本着平等互惠的原则，就乙方作为甲方的代理商事宜，达成以下协议：</p>
            <h2>第一条：代理资格</h2>
            <p>1.1、凭真实、准确、有效个人信息资料登记，获得“丝霖蔓雨品牌”代理商资格，获得同类别产品的品牌股东，不享受其他类别的代理权及产品品牌股东。</p>
            <p>1.2、严格遵守甲方的品牌代理销售策略、代理商事业守则及本协议其他相关规定。</p>
            <h2>第二条：品牌代理权限</h2>
            <p>2.1、乙方获得甲方代理资格后，享受产品折扣优惠，获得等值的“丝霖蔓雨品牌”同类别的产品。</p>
            <p>2.2、按照抢购“丝霖蔓雨品牌”代理权，可以多次抢购代理权，抢购代理权数量依次录入系统获得相应的点位并按照时间顺序进入系统排列。</p>
            <p>2.3、获得“丝霖蔓雨品牌”代理商资格后，同时获得本系列产品的品牌股东资格，不享受其他类别的代理权及产品品牌股东。</p>
            <p>2.4、获得代理商资格后可以在全国及全世界开展产品推广销售业务，如果需要在其他电商平台销售必须提前向甲方报备，经审核通过，并获得甲方授权后方可销售，未经授权私自在其他平台销售，出现一切后果由乙方承担全部责任。</p>
            <p>2.5、本协议在APP确认签订之日起生效，有效期两年，乙方有续约意向，需提前一个月申请，否则视为放弃。</p>
            <h2>第三条：甲方的责任、权利和义务</h2>
            <p>3.1、乙方成为甲方“丝霖蔓雨品牌”代理资格后，甲方提前生产或按照订单提供的货源。</p>
            <p>3.2、甲方提供相应的宣传资料给乙方。</p>
            <p>3.3、甲方为乙方提供“丝霖蔓雨品牌”经营理念及产品知识等相关培训。</p>
            <h2>第四条：乙方的责任和义务</h2>
            <p>4.1、乙方获得代理商资格后，必须做到合法经营，不欺骗、不诱惑他人成为合作伙伴，不允许拉人头充人数。</p>
            <p>4.2、不允许以“丝霖蔓雨品牌”进行融资、集资、募捐等诈骗行为，一经发现追究法律责任。</p>
            <p>4.3、不允许以“丝霖蔓雨品牌”推广其他的产品与项目；“丝霖蔓雨品牌”所有的产品信息以官网或APP发布为主。</p>
            <p>4.4、不允许以攻击、轻视、诋毁其他职业、行业、公司、品牌及其从业人员的声誉来抬高自己。</p>
            <p>4.5不以任何方式歪曲“丝霖蔓雨品牌”产品的价格、规格、品质、性能、等级、成份、款式、型号、产地或供应情况等资料。</p>
            <p>4.6、代理之间相互合作，不允许以诋毁、降低产品价格等方式破坏市场合作。</p>
            <p>4.7、代理商需要到访公司的，必须提前与公司联系，没有提前联系的，接待人员服务不到位的，公司概不负责。</p>
            <p>4.8、成为“丝霖蔓雨品牌”代理商（品牌股东）的必须参加公司组织的培训，学习产品知识、经营理念，学习如何有效的开展业务，学习app如何应用等。</p>
            <p>4.9、成为“丝霖蔓雨品牌”代理商需遵守代理商事业守则，有义务组织其他代理商、消费商的培训和学习。</p>
            <p>4.10、成为“丝霖蔓雨品牌”代理商是公平自愿的，熟知“丝霖蔓雨品牌”经营理念的。</p>
            <p>4.11、成为“丝霖蔓雨品牌”代理商熟知四网合一及APP串码技术的应用。</p>
            <h2>第五条：代理商（品牌股东）所享受的权利</h2>
            <p>5.1、获得APP上的收益，按照提现规则，可以随时提现。</p>
            <p>5.2、获得创业的平台及网络媒体的宣传。</p>
            <p>5.3、获得APP系统匹配的产品专属二维码。</p>
            <p>5.4、获得“丝霖蔓雨品牌”代理同类别产品的品牌股东。不享受其他类别的代理权及产品品牌股东。</p>
            <p>5.5、对于有能力想再次创业的可以获得相应的资金支持。</p>
            <h2>第六条：代理价格，销售指标</h2>
            <p>6.1乙方必须按照甲方的统一价格进行销售，不允许出现降价或者打折销售，除非接到甲方促销活动通知；甲方因各种原因需变更价格，应于调整前1个月通知乙方。</p>
            <p>6.2、签订本协议的代理商代理“丝霖蔓雨品牌”产品的品牌股东，可以参与不定期的产品发布抢购。</p>
            <h2>七、责任声明</h2>
            <p>7.1、乙方向甲方订货时，须提前一个月填写订货单，或随时关注APP产品抢购，甲方在收到订货单和货款后，配备专属二维码发货。</p>
            <p>7.2、结算方式：需提前下单，按照下单时间顺序发货。</p>
            <p>7.3、乙方承担进货（发货）快递物流费用。</p>
            <p>7.4、乙方在收到货物后第一时间开箱验货，如有商品破坏或者缺失，须立即通知甲方，否则视为验收合格。</p>
            <h2>第八条：售后服务</h2>
            <p>8.1、乙方需协助甲方对市场定期做好售后服务，维护APP运营及市场管理。</p>
            <p>8.2、市场出现反馈产品质量问题，需提供相关真实证据（文字、相关照片、截图），不能无据说明产品质量问题。</p>
            <h2>第九条：违约责任</h2>
            <p>9.1、乙方如违反本协议条款，甲方可随时解除本协议。</p>
            <p>9.2、甲乙双方如发生严重违反本协议条款，严重违反商业道德和法律或损害对方利益，均可以书面形式终止本协议。</p>
            <p>9.3、乙方代理期间如乱价销售，扰乱市场，甲方可随时撤销乙方代理权利，解除本协议。</p>
            <h2>第十条：商业秘密保护</h2>
            <p>10.1、乙方在与甲方进行业务交往过程中，对甲方商业秘密应履行严格的保密义务，并采取相应的保密措施；未经甲方许可，不得自行使用和许可第三方使用，不得出现泄密事件（包括主动向第三方泄露或因保护不当为第三方获知）。</p>
            <p>10.2、乙方在与甲方进行业务交往过程中，不得通过任何不正当途径与手段探听、窃取、使用或泄露甲方之商业秘密。</p>
            <h2>第十一条：争议的解决</h2>
            <p>本合同在履行中发生争议，由甲乙双方协商解决；协商不成，甲乙双方通过甲方所在地人民法院裁决。</p>
            <h2>第十二条：生效方式</h2>
            <p>12.1、本合同一式两份，甲乙双方各执一份。</p>
            <p>12.2、双方签字盖章后合同生效，</p>
            <p>12.3、同时代理产品品牌股东的身份也及时生效。</p>
            <p>12.4、APP上传的协议，自代理商确认起生效，同具法律效应。</p>
            <p>12.5、协议内容的最终解释权归甲方所有。</p>
            <div style={{marginTop:'1rem'}}>
                <h3 style={{textAlign:'right',fontSize:'.35rem',marginBottom:'.2rem'}}>西安市钱库商贸有限公司</h3>
                <h3 style={{textAlign:'right',fontSize:'.35rem',marginRight:'.5rem'}}>2018年9月</h3>
            </div>
        </div>
      </div>
    )

  }
}





